---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ToposolidContourSubcategoryId
source: html/314e4981-c6a4-580c-5c32-28bd133ec275.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ToposolidContourSubcategoryId Property

"Subcategory"

## Syntax (C#)
```csharp
public static ForgeTypeId ToposolidContourSubcategoryId { get; }
```